packages/StoveOpt/StoveOpt-0.3.7.tar.gz/StoveOpt-0.3.7/StoveOpt/foamfiles/counterFlowFlame2D/case_50/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 293;
    }
    primary_air
    {
        type            fixedValue;
        value           uniform 293;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }
	Secondary_air_RHS
    {
		type            fixedValue;
        value           uniform 293;
    }
    Secondary_air_LHS
    {
        type            fixedValue;
        value           uniform 293;
    }
	stove_body //This will probably need to change
	{
		type			fixedValue; 
		value			uniform 293; 
	
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
